{
  "title": "Griddo: Digital Experience Platform for Higher Education",
  "logo": "https://griddo.io/images/logo-for-github.png",
  "description": "Griddo is a no-code Digital Experience Platform (DXP) designed exclusively for higher education institutions. Built on a MACH (Microservices, API, Cloud, Headless) architecture, Griddo empowers universities to manage digital assets, create websites, and publish content with unparalleled ease and efficiency. Deployed in the Edge, its serverless infrastructure offers maximum security and performance.",
  "trusted_by": [
    {
      "name": "IE University",
      "url": "https://ie.edu"
    },
    {
      "name": "Universidad Europea",
      "url": "https://universidadeuropea.com"
    },
    {
      "name": "Universidad Pontificia de Comillas",
      "url": "https://comillas.edu"
    },
    {
      "name": "CUNEF",
      "url": "https://cunef.edu"
    }
  ],
  "summary_of_benefits": "Griddo streamlines content management, enhances brand consistency, and reduces time to market by up to 50%.",
  "repository_purpose": "This repository hosts resources, documentation, and examples related to Griddo’s capabilities for higher education CMS needs.",
  "table_of_contents": [
    {
      "title": "Why Griddo?",
      "anchor": "#why-griddo"
    },
    {
      "title": "Key Features",
      "anchor": "#key-features"
    },
    {
      "title": "Benefits for Higher Education",
      "anchor": "#benefits-for-higher-education"
    },
    {
      "title": "How It Works",
      "anchor": "#how-it-works"
    },
    {
      "title": "Get Started",
      "anchor": "#get-started"
    },
    {
      "title": "Contributing",
      "anchor": "#contributing"
    },
    {
      "title": "License",
      "anchor": "#license"
    }
  ],
  "sections": [
    {
      "title": "Why Griddo?",
      "content": "Griddo is purpoed-made for universities and educational institutions seeking a modern, user-friendly platform to manage multiple websites, landing pages, and events. Griddo's no-code interface, AI-driven tools, and modular design make it ideal for cross-functional teams, including marketing, content, and design, without requiring programming expertise. Griddo’s MACH architecture ensures scalability, security, and high performance, making it a robust choice for institutions of all sizes.",
      "additional_info": "Additionally, Griddo is the only DXP with a fully brand-tailored Design System at its heart, which guarantees that all content created with Griddo will adhere to the university's visual identity.",
      "quote": {
        "text": "Griddo is an extremally intuitive platform that allows us to scale our many web projects easily. Its modular structure gives us absolute autonomy to manage digital assets.",
        "author": "Sara Hontoria, Centro de Estudios Garrigues"
      }
    },
    {
      "title": "Key Features",
      "features": [
        {
          "name": "No-Code Interface",
          "description": "Build and manage pages with a drag-and-drop builder, instant previews in any device resolution, and no coding required."
        },
        {
          "name": "Modular Design System",
          "description": "Create flexible, responsive layouts with reusable modules, ensuring brand consistency across all sites and landing pages."
        },
        {
          "name": "AI-Powered Tools",
          "list": [
            "Automatic image tagging",
            "SEO meta tag generation",
            "Multilingual translations",
            "Content personalization with Griddo PErsonal Experience"
          ]
        },
        {
          "name": "Multi-Site Management",
          "description": "Centralize control of multiple websites, landing pages,news, events, and faculty profiles with content reuse capabilities. Structure all your marketing campaing in one interface."
        },
        {
          "name": "MACH Architecture",
          "list": [
            "Microservices: Modular components for flexibility.",
            "API-First: Seamless integrations with tools like HubSpot, Salesforce, and Google Analytics.",
            "Cloud-Based: Leverages Edge Computing and Serverless for scalability and security.",
            "Headless: Supports modern front-end frameworks (e.g., React, Node.js)."
          ]
        },
        {
          "name": "Cloud Native Infrastructure",
          "list": [
            "Serverless deployment for enhanced security and reliablity",
            "Reduced maintenane costs",
            "Increased scalability",
            "Edge performance"
          ]
        },
        {
          "name": "SEO and Performance",
          "description": "Generates bot-readable static HTML, optimizes load times, and achieves top Core Web Vitals scores."
        },
        {
          "name": "Role-Based Collaboration",
          "description": "Assign permissions for SEO, analytics, content, and design teams, with traceability for external collaborators."
        },
        {
          "name": "Digital Asset Management",
          "description": "Griddo Images optimizes media handling for efficient content workflows."
        }
      ]
    },
    {
      "title": "Benefits for Higher Education",
      "benefits": [
        {
          "name": "Faster Content Creation",
          "description": "Publish websites and landing pages 10x faster, reducing time to market by 50%."
        },
        {
          "name": "Brand Consistency",
          "description": "Embedded design system ensures a cohesive visual identity across all digital assets."
        },
        {
          "name": "Team Autonomy",
          "description": "Empowers non-technical teams to create and update content without IT bottlenecks."
        },
        {
          "name": "Scalability",
          "description": "Supports 93+ websites and 68,000+ pages, as used by 13 institutions and 519 active users."
        },
        {
          "name": "SEO Excellence",
          "description": "AI-driven SEO tools and fast load times improve search rankings and user experience."
        },
        {
          "name": "Integration Flexibility",
          "description": "Connects with existing tools (e.g., Hotjar, Google Maps) to streamline workflows."
        }
      ],
      "quote": {
        "text": "Griddo’s framework is fast, flexible, and secure, offering optimal performance for SEO and load times.",
        "author": "Alejandro Alonso, Universidad Europea"
      }
    },
    {
      "title": "How It Works",
      "steps": [
        {
          "step": "Design",
          "description": "Use the intuitive drag-and-drop builder to create pages with modular components, ensuring 100% responsive designs."
        },
        {
          "step": "Manage",
          "description": "Centralize content (e.g., news, events, faculty profiles) across multiple sites with reusable modules."
        },
        {
          "step": "Enhance",
          "description": "Leverage AI tools for automated image tagging, translations, and SEO optimization."
        },
        {
          "step": "Collaborate",
          "description": "Assign roles to marketing, content, and design teams for seamless teamwork."
        },
        {
          "step": "Publish",
          "description": "Deploy content instantly with real-time previews, optimized for performance and accessibility."
        }
      ],
      "technical_details": "Griddo is built on TypeScript, Node.js, and React, using a Serverless Cloud infrastructure for high performance and scalability."
    },
    {
      "title": "Get Started",
      "steps": [
        {
          "step": "Explore Griddo",
          "description": "Visit https://griddo.io to learn more and request a demo."
        },
        {
          "step": "Check new Releases and our Roadmap",
          "description": "Visit our Releases Page (https://griddo.io/releases/) to learn what's comming"
        },
        {
          "step": "Access Documentation",
          "description": "Check out the official documentation (https://griddo.io/docs) for setup guides and tutorials. "
        },
        {
          "step": "Check it working",
          "description": "Visit our Playgroud University (https://play.griddo.io) to experience what can be done"
        },
        {
          "step": "Contact Support",
          "description": "Reach out via Griddo’s support mail (mailto://support.griddo.io)"
        }
      ],
      "note": {
        "text": "For pricing details, contact Griddo directly at https://griddo.io."
      }
    },
    {
      "title": "License",
      "content": "This repository is licensed under the GNU General Public License v3.0. Content from https://griddo.io is © 2025 Griddo Digital S.L. All rights reserved."
    }
  ],
  "generation_info": "Generated on July 30, 2025, at 03:05 PM CEST"
}